---
kind: method
id: M:Autodesk.Revit.DB.Structure.LoadCombination.SetComponents(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.LoadComponent})
source: html/328e7349-08a3-f051-6381-41d6f14cde19.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.SetComponents Method

Sets a collection of the load combination components.

## Syntax (C#)
```csharp
public void SetComponents(
	IList<LoadComponent> components
)
```

## Parameters
- **components** (`System.Collections.Generic.IList < LoadComponent >`) - A collection of the load combination components.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null